In [1]:
import pandas as pd

In [5]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [10]:
# rename a column

df_exams.rename(columns={'gender': 'Gender'}, inplace=True)

In [13]:
df_exams.rename(columns={'math score': 'MS',
                         'reading score': 'RS',
                         'writing score': 'WS'}, inplace=True) 
df_exams.head()

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### Renaming Index

In [ ]:
# rename index from '0,1,2' to 'a,b,c'

df_exams.rename(index={0:'a', 1:'b', 2:'c'}, inplace=True)
df_exams.head()

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS
a,female,group B,bachelor's degree,standard,none,72,72,74
b,female,group C,some college,standard,completed,69,90,88
c,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75